Documents/РаспределениеХолоднойВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РаспределениеХолоднойВоды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РаспределениеХолоднойВоды</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОбщедомовое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаИндивидуальная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДосчитаноДоКонцаМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>спУслугаИндивидуальная</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоеффициентРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Энергоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АктСнятияПоказанийХолоднойВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АктСнятияПоказанийХолоднойВоды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеТекущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаспределениеХолоднойВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеХолоднойВоды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОбщедомовое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДосчитаноДоКонцаМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаИндивидуальная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбщедомовойПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчетПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПотребителейУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПотребителейУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прописанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проживающие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспределениеХолоднойВоды/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПолучитьПоказания(ПриборУчета, ПериодНачисления)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.РазницаПоказания,
	    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.Период
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийХолоднойВоды.СрезПоследних(
	    |			&НаДату,
	    |			ПриборУчета = &ПриборУчета
	    |				И ПериодНачисления = &ПериодНачисления) КАК АктСнятияПоказанийХолоднойВодыСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ДанныеВыборки = Новый Структура;
	Пока Выборка.Следующий() Цикл
		ДанныеВыборки.Вставить("КвоКубов", Выборка.РазницаПоказания);
		ДанныеВыборки.Вставить("ДатаСнятия", Выборка.Период);
	КонецЦикла;
	Возврат ДанныеВыборки;
КонецФункции

&НаСервере
Функция ПолучитьДоначислениеПрошлогоМесяца(ПриборУчета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	РаспределениеХолоднойВодыСрезПоследних.ДосчитаноДоКонцаМесяца
	    |ИЗ
	    |	РегистрСведений.РаспределениеХолоднойВоды.СрезПоследних КАК РаспределениеХолоднойВодыСрезПоследних
	    |ГДЕ
	    |	РаспределениеХолоднойВодыСрезПоследних.Период МЕЖДУ &НачПериода И &КонПериода
	    |	И РаспределениеХолоднойВодыСрезПоследних.ОбщедомовойПриборУчета = &ОбщедомовойПриборУчета
	    |	И РаспределениеХолоднойВодыСрезПоследних.Активность = ИСТИНА";
	Запрос.УстановитьПараметр("ОбщедомовойПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("НачПериода", ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1));
	Запрос.УстановитьПараметр("КонПериода", ДобавитьМесяц(КонецМесяца(Объект.Дата), -1));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Значение = Выборка.ДосчитаноДоКонцаМесяца;
	КонецЦикла;
	Если Значение = Неопределено Тогда
		Значение = 0;
	КонецЕсли;
	Возврат Значение;
КонецФункции

// Процедура ЗаполнитьНаСервере()
//
&НаСервере
Процедура ЗаполнитьНаСервере1()
	
	РасчитыватьЭнергоемкость = Объект.Услуга.РасчитыватьЭнергоемкость;
	
	Если ЗначениеЗаполнено(Объект.УслугаИндивидуальная) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки КАК ЛицевойСчет,
			|	СУММА(РасчетПоказанийПриборовУчетаОбороты.ЗначениеПриход) КАК Значение,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Период, &ПериодКон) КАК период,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Действует, ЛОЖЬ) КАК Действует
			|ИЗ
			|	РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(&ПериодНач, &ПериодКон, Месяц, Услуга = &Услуга) КАК РасчетПоказанийПриборовУчетаОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенныеУслуги.СрезПоследних(&ПериодКон, Услуга = &Услуга) КАК НазначенныеУслугиСрезПоследних
			|		ПО РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки = НазначенныеУслугиСрезПоследних.ЛицевойСчет
			|			И РасчетПоказанийПриборовУчетаОбороты.Услуга = НазначенныеУслугиСрезПоследних.Услуга
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Действует, ЛОЖЬ),
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Период, &ПериодКон)";
			
		Запрос.УстановитьПараметр("ПериодНач",	НачалоМесяца(Объект.ПериодНачисления));		
		Запрос.УстановитьПараметр("ПериодКон",	КонецМесяца(Объект.ПериодНачисления));		
		Запрос.УстановитьПараметр("Услуга", 	Объект.УслугаИндивидуальная);		
		
		ТаблицаУслугСоСчетчиками = Запрос.Выполнить().Выгрузить();
		
		ТаблицаУслугСоСчетчиками.Колонки.Добавить("Дней", Новый ОписаниеТипов("Число"));
		ЗначениеСоСчетчиками = ТаблицаУслугСоСчетчиками.Итог("Значение");
		МассивЛС = Новый Массив;
		Для каждого Строка  Из ТаблицаУслугСоСчетчиками Цикл
		
			Если НЕ Строка.Действует Тогда 
				
			      Строка.Дней = (НачалоМесяца(Объект.ПериодНачисления) - НачалоДня(Строка.Период))/(60*60*24);
			  Иначе
				  МассивЛС.Добавить(Строка.ЛицевойСчет);
				  Строка.Дней = 0
			
			КонецЕсли; 
		
		КонецЦикла; 
		МассивЛС = ТаблицаУслугСоСчетчиками.ВыгрузитьКолонку("ЛицевойСчет");
	Иначе
		МассивЛС = Новый Массив;
		ЗначениеСоСчетчиками = 0;		
	КонецЕсли; 	
	
	Если ТипЗнч(Объект.Услуга.БазаРаспределенияРасчетнойУслуги) = Тип("ПеречислениеСсылка.ВидыПотребителейУслуг") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	ВЫБОР
			|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
			|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
			|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
			|	КОНЕЦ КАК ЗначениеБазы,
			|	&Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	ВЫБОР
			|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
			|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
			|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
			|	КОНЕЦ,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
		
	Иначе
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0) КАК ЗначениеБазы,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	&Период КАК Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0),
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
			
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.ПериодНачисления));		
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);		
	Запрос.УстановитьПараметр("ВидБазыРаспределения", Объект.Услуга.БазаРаспределенияРасчетнойУслуги);		
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.УстановитьПараметр("Подъезд", Объект.Подъезд);
	//Запрос.УстановитьПараметр("СписокЛицевыхСчетов", МассивЛС);
	
	ТаблицаЛицевыхСчетов = Запрос.Выполнить().Выгрузить();
	ТаблицаЛицевыхСчетов.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	ТаблицаЛицевыхСчетов.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	
		
	ЗначениеДляРаспределения = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
	КонецПериодаРаспределения = КонецМесяца(Объект.ПериодНачисления);
	
	Для каждого Строка Из ТаблицаЛицевыхСчетов Цикл
		
		КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);
		Строка.ЗначениеБазыСКоэффициентом  = Строка.ЗначениеБазы * КоэффициентПоДням; 
			
	КонецЦикла;
	
	ИтогБазы = ТаблицаЛицевыхСчетов.Итог("ЗначениеБазыСКоэффициентом");
	Если ИтогБазы = 0 Тогда
		Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
		Возврат;
	КонецЕсли;

	
	Для каждого Строка Из ТаблицаЛицевыхСчетов Цикл
		
		НоваяСтрока = Объект.Основная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		//КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);// определим весь месяц или только часть его оказывалась услуга в %
		НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		НоваяСтрока.Показание = ЗначениеДляРаспределения * (Строка.ЗначениеБазыСКоэффициентом / ИтогБазы);
		Если РасчитыватьЭнергоемкость Тогда
			НоваяСтрока.Энергоемкость = НоваяСтрока.Показание/Строка.ЗначениеБазы;
		Иначе
			НоваяСтрока.Энергоемкость = 0;
		КонецЕсли;	
	КонецЦикла; 
	
	Если Объект.Основная.Количество()> 0 Тогда
	    ГСЧ = Новый ГенераторСлучайныхЧисел();
		СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

		ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
	    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;
		
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьНаСервере()

&НаСервере
Процедура ЗаполнитьНаСервере2()
	РасчитыватьЭнергоемкость = Объект.Услуга.РасчитыватьЭнергоемкость;
	Если НЕ ЗначениеЗаполнено(Объект.УслугаИндивидуальная) Тогда
		Сообщить("Не заповнена послуга з лічильниками!");
		Возврат;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки,
			|	СУММА(РасчетПоказанийПриборовУчетаОбороты.ЗначениеПриход) КАК Значение
			|ИЗ
			|	РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
			|			&НачПериода,
			|			&КонПериода,
			|			Месяц,
			|			Услуга = &Услуга
			|				И ОбъектУстановки.Владелец = &Здание) КАК РасчетПоказанийПриборовУчетаОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки";
		Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.ПериодНачисления));
		Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.ПериодНачисления));		
		Запрос.УстановитьПараметр("Услуга", 	Объект.УслугаИндивидуальная);
		Запрос.УстановитьПараметр("Здание",     Объект.Здание);
		
		ТаблицаУслугСоСчетчиками = Запрос.Выполнить().Выгрузить();
		ЗначениеСоСчетчиками     = ТаблицаУслугСоСчетчиками.Итог("Значение");
		
		// Выбор услуг без приборов учета		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
		    |	НазначенныеУслугиСрезПоследних.Действует,
		    |	НазначенныеУслугиСрезПоследних.Период
		    |ИЗ
		    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
		    |			&НаДату,
		    |			ЛицевойСчет.Владелец = &Здание
		    |				И Организация = &Организация
		    |				И Услуга <> &Услуга) КАК НазначенныеУслугиСрезПоследних";
		Запрос.УстановитьПараметр("НаДату",      КонецМесяца(Объект.ПериодНачисления));
		Запрос.УстановитьПараметр("Здание",      Объект.Здание);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Услуга",      Объект.УслугаИндивидуальная);
		
		ТаблицаУслугБезСчетчиков = Запрос.Выполнить().Выгрузить();
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	    ТаблицаУслугБезСчетчиков.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		
		Если ТаблицаУслугБезСчетчиков.Количество() = 0 Тогда
			
			ЗначениеДляРаспределения  = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
			КонецПериодаРаспределения = КонецМесяца(Объект.ПериодНачисления);
			Для Каждого Строка Из ТаблицаУслугБезСчетчиков Цикл	
				КвоПроживающих = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Строка.ЛицевойСчет);  //КоличествоПроживающих
				КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);
				Строка.ЗначениеБазыСКоэффициентом  = КвоПроживающих.КоличествоПроживающих * КоэффициентПоДням; 	
			КонецЦикла;
			ИтогБазы = ТаблицаУслугБезСчетчиков.Итог("ЗначениеБазыСКоэффициентом");
			Если ИтогБазы = 0 Тогда
				Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
				Возврат;
			КонецЕсли;
			
			Для Каждого стр Из ТаблицаУслугБезСчетчиков Цикл
				НоваяСтрока = Объект.Основная.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
				//КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);// определим весь месяц или только часть его оказывалась услуга в %
				НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Показание = ЗначениеДляРаспределения * (Строка.ЗначениеБазыСКоэффициентом / ИтогБазы);
				Если РасчитыватьЭнергоемкость Тогда
					НоваяСтрока.Энергоемкость = НоваяСтрока.Показание/Строка.ЗначениеБазы;
				Иначе
					НоваяСтрока.Энергоемкость = 0;
				КонецЕсли;	
			КонецЦикла;
			
			Если Объект.Основная.Количество()> 0 Тогда
			    ГСЧ = Новый ГенераторСлучайныхЧисел();
				СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

				ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
			    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;		
			КонецЕсли;
		Иначе
			ЗначениеДляРаспределения   = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
			Если ЗначениеДляРаспределения <= 0 Тогда
				Сообщить("Різниця між показником загальнобудинкового лічильника - " + Объект.ЗначениеОбщедомовое + ", і сумою показників по лічильниках абонентів - " + ЗначениеСоСчетчиками + " менше, або дорівнює 0. Розподіляти нічого!");
				Возврат;
			КонецЕсли;
			Значение = ЗначениеДляРаспределения / ТаблицаУслугСоСчетчиками.Количество();
			Для Каждого стр Из ТаблицаУслугСоСчетчиками Цикл
				НоваяСтр = Объект.Основная.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
				НоваяСтр.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Показание = стр.ЗначениеБазыСКоэффициентом * Значение;
			КонецЦикла;
			Если Объект.Основная.Количество()> 0 Тогда
			    ГСЧ = Новый ГенераторСлучайныхЧисел();
				СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

				ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
			    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	РасчитыватьЭнергоемкость = Объект.Услуга.РасчитыватьЭнергоемкость;
	Если НЕ ЗначениеЗаполнено(Объект.УслугаИндивидуальная) Тогда
		Сообщить("Не заповнена послуга з лічильниками!");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(УслугаБезСчетчиков) Тогда
		Сообщить("Не заповнена послуга без лічильників!");
		Возврат;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки КАК ЛицевойСчет,
			|	СУММА(РасчетПоказанийПриборовУчетаОбороты.ЗначениеПриход) КАК Значение,
			|	РасчетПоказанийПриборовУчетаОбороты.Период
			|ИЗ
			|	РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
			|			&НачПериода,
			|			&КонПериода,
			|			Месяц,
			|			Услуга = &Услуга
			|				И ОбъектУстановки.Владелец = &Здание) КАК РасчетПоказанийПриборовУчетаОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки,
			|	РасчетПоказанийПриборовУчетаОбороты.Период";
		Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.НачПериода));
		Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.КонПериода));		
		Запрос.УстановитьПараметр("Услуга", 	Объект.УслугаИндивидуальная);
		Запрос.УстановитьПараметр("Здание",     Объект.Здание);
		
		ТаблицаУслугСоСчетчиками = Запрос.Выполнить().Выгрузить();
		ЗначениеСоСчетчиками     = ТаблицаУслугСоСчетчиками.Итог("Значение");
		ТаблицаУслугСоСчетчиками.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	    ТаблицаУслугСоСчетчиками.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		
		
		// Выбор услуг без приборов учета		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			//|	НазначенныеУслугиСрезПоследних.Действует,
			//|	НазначенныеУслугиСрезПоследних.Период,
			//|	НазначенныеУслугиСрезПоследних.Услуга,
			//|	НазначенныеУслугиСрезПоследних.Услуга.КвоКубов
			//|ИЗ
			//|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			//|			&НаДату,
			//|			ЛицевойСчет.Владелец = &Здание
			//|				И Организация = &Организация
			//|				И Действует = ИСТИНА
			//|				И Услуга В (&Услуга)) КАК НазначенныеУслугиСрезПоследних";
			
			  "ВЫБРАТЬ РАЗЛИЧНЫЕ
			  |	0 КАК ИндексНабора,
			  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			  |	НазначенныеУслугиСрезПоследних.Организация,
			  |	НазначенныеУслугиСрезПоследних.Действует,
			  |	НазначенныеУслугиСрезПоследних.Услуга,
			  |	НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги,
			  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
			  |	НазначенныеУслугиСрезПоследних.Период КАК ДатаНачалаДействия,
			  |	МАКСИМУМ(НазначенныеУслуги.Период) КАК ДатаОкончанияДействия,
			  |	НазначенныеУслугиСрезПоследних.Регистратор КАК РегистраторДействующих
			  |ИЗ
			  |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			  |			&Период,
			  |			Действует
			  |				И ЛицевойСчет.Владелец = &Здание
			  |				И Организация = &Организация
			  |				И Услуга В (&Услуга)) КАК НазначенныеУслугиСрезПоследних
			  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенныеУслуги КАК НазначенныеУслуги
			  |		ПО НазначенныеУслугиСрезПоследних.Организация = НазначенныеУслуги.Организация
			  |			И НазначенныеУслугиСрезПоследних.ЛицевойСчет = НазначенныеУслуги.ЛицевойСчет
			  |			И НазначенныеУслугиСрезПоследних.Услуга = НазначенныеУслуги.Услуга
			  |			И (НазначенныеУслуги.Действует = ЛОЖЬ)
			  |			И (НазначенныеУслуги.Период > &Период)
			  |
			  |СГРУППИРОВАТЬ ПО
			  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			  |	НазначенныеУслугиСрезПоследних.Организация,
			  |	НазначенныеУслугиСрезПоследних.Действует,
			  |	НазначенныеУслугиСрезПоследних.Услуга,
			  |	НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги,
			  |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец,
			  |	НазначенныеУслугиСрезПоследних.Период,
			  |	НазначенныеУслугиСрезПоследних.Регистратор";
			
			
			
		Запрос.УстановитьПараметр("Период",	     КонецМесяца(Объект.КонПериода));
		//Запрос.УстановитьПараметр("НаДату",      КонецМесяца(Объект.ПериодНачисления));
		Запрос.УстановитьПараметр("Здание",      Объект.Здание);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Услуга",      УслугаБезСчетчиков);
		
		ТаблицаУслугБезСчетчиков = Запрос.Выполнить().Выгрузить();
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
		ТаблицаУслугБезСчетчиков.Колонки.Добавить("КвоПроживающих", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)));
		
		Если ТаблицаУслугБезСчетчиков.Количество() <> 0 Тогда
			ЗначениеКубовПоНорме = 0;
			ЗначениеДляРаспределения  = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
			КонецПериодаРаспределения = КонецМесяца(Объект.КонПериода);
			НачалоПериодаРаспределения = НачалоМесяца(Объект.НачПериода);
			Для Каждого Строка Из ТаблицаУслугБезСчетчиков Цикл
				ЗначениеНормы  = ОпределениеЗначениеНормы(Строка.Услуга, Строка.ЛицевойСчет.Владелец, Строка.ЛицевойСчет);
				КвоПроживающих = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Строка.ЛицевойСчет);  //КоличествоПроживающих
				ЗначениеКубовПоНорме = ЗначениеКубовПоНорме + (ЗначениеНормы * КвоПроживающих.КоличествоПроживающих); 
				Строка.КвоПроживающих = КвоПроживающих.КоличествоПроживающих;
				КоэффициентПоДням = День(НачалоПериодаРаспределения)/День(КонецПериодаРаспределения);
				Строка.ЗначениеБазыСКоэффициентом  = КвоПроживающих.КоличествоПроживающих * КоэффициентПоДням; 	
			КонецЦикла;
			ЗначениеДляРаспределения = ЗначениеДляРаспределения - ЗначениеКубовПоНорме;
			//ЗначениеДляРаспределения = ЗначениеДляРаспределения - (ЗначениеНормы * ТаблицаУслугБезСчетчиков.Количество()); 
 			ИтогБазы = ТаблицаУслугБезСчетчиков.Итог("ЗначениеБазыСКоэффициентом");
			Если ИтогБазы = 0 Тогда
				Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
				Возврат;
			КонецЕсли;
			
			Для Каждого стр Из ТаблицаУслугБезСчетчиков Цикл
				НоваяСтрока = Объект.Основная.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
				НоваяСтрока.ОбъектЛицевогоСчета = стр.ЛицевойСчет.ОбъектЛицевогоСчета;
				НоваяСтрока.ОтветственныйВладелец = ОпределитьответственныйВладелец(стр.ЛицевойСчет);
				//КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);// определим весь месяц или только часть его оказывалась услуга в %
				НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Показание = ЗначениеДляРаспределения * (стр.ЗначениеБазыСКоэффициентом / ИтогБазы);   //ТаблицаУслугБезСчетчиков.Итог("КвоПроживающих")
				Если РасчитыватьЭнергоемкость Тогда
					НоваяСтрока.Энергоемкость = НоваяСтрока.Показание/Строка.ЗначениеБазы;
				Иначе
					НоваяСтрока.Энергоемкость = 0;
				КонецЕсли;	
			КонецЦикла;
			
			Если Объект.Основная.Количество()> 0 Тогда
			    ГСЧ = Новый ГенераторСлучайныхЧисел();
				СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

				ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
			    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;		
			КонецЕсли;
		Иначе
			НачислениеПоСреднему = ОпределитьСредннеНачисление(Объект.Здание);
			НачислениеПоСреднему.Свернуть("Период, ЛицевойСчет", "Разница");
			Если НачислениеПоСреднему.Количество() <> 0 Тогда
				Для Каждого стр Из НачислениеПоСреднему Цикл
					Отбор = Новый Структура;
					Отбор.Вставить("ЛицевойСчет", стр.ЛицевойСчет);
					Отбор.Вставить("Период", НачалоМесяца(стр.Период));
					ЗначениеПоСчетчику = ТаблицаУслугСоСчетчиками.НайтиСтроки(Отбор);
					Для Каждого стрТаб Из ЗначениеПоСчетчику Цикл
						Если стрТаб.Значение <> 0 Тогда
							стрТаб.Значение = 0;
							стрТаб.Значение = стр.Разница * Объект.КоеффициентРаспределения;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			ЗначениеСоСчетчиками = ТаблицаУслугСоСчетчиками.Итог("Значение");
			
			ЗначениеДляРаспределения   = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
			Если ЗначениеДляРаспределения <= 0 Тогда
				Сообщить("Різниця між показником загальнобудинкового лічильника - " + Объект.ЗначениеОбщедомовое + ", і сумою показників по лічильниках абонентів - " + ЗначениеСоСчетчиками + " менше, або дорівнює 0. Розподіляти нічого!");
				//Возврат;
			КонецЕсли;
			Значение = ЗначениеДляРаспределения / ЗначениеСоСчетчиками;
			КонецПериодаРаспределения = КонецМесяца(Объект.КонПериода);
			Для Каждого Строка Из ТаблицаУслугСоСчетчиками Цикл
				КвоПроживающих = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Строка.ЛицевойСчет);  //КоличествоПроживающих
				КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);
				Строка.ЗначениеБазыСКоэффициентом  = КвоПроживающих.КоличествоПроживающих * КоэффициентПоДням; 	
			КонецЦикла;
			
			ТаблицаУслугСоСчетчиками.Свернуть("ЛицевойСчет, Период, Показание, ЗначениеБазыСКоэффициентом", "Значение");
			Для Каждого стр Из ТаблицаУслугСоСчетчиками Цикл
				НоваяСтр = Объект.Основная.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
				НоваяСтр.ОбъектЛицевогоСчета = стр.ЛицевойСчет.ОбъектЛицевогоСчета;
				НоваяСтр.ОтветственныйВладелец = ОпределитьответственныйВладелец(стр.ЛицевойСчет);
				НоваяСтр.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтр.Показание = стр.Значение * Значение;
			КонецЦикла;
			Если Объект.Основная.Количество()> 0 Тогда
			    ГСЧ = Новый ГенераторСлучайныхЧисел();
				СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

				ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
			    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;		
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
	//УслугаБезСчетчиков = Объект.спУслугаИндивидуальная;
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	//Объект.спУслугаИндивидуальная = УслугаБезСчетчиков;
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере();	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисления 		= КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	

	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПрибораУчетаПриИзмененииНаСервере()
	Объект.Здание = Объект.ЛицевойСчетПрибораУчета.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПрибораУчетаПриИзменении(Элемент)
	ЛицевойСчетПрибораУчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбщедомовойПриборУчетаПриИзмененииНаСервере()
    ДанныеСчетчика             = ПолучитьПоказания(Объект.ОбщедомовойПриборУчета, Объект.ПериодНачисления);
	ЕдИзмСчетчика              = Объект.ОбщедомовойПриборУчета.ЕдиницаИзмерения;
	ДосчитановВПрошломМесяце   = ПолучитьДоначислениеПрошлогоМесяца(Объект.ОбщедомовойПриборУчета);
	Если ДосчитановВПрошломМесяце = Неопределено Тогда
		ДосчитановВПрошломМесяце = 0;
	КонецЕсли;
	КвоДнейДляДочисления       = ((КонецМесяца(ДанныеСчетчика.ДатаСнятия) - КонецМесяца(ДанныеСчетчика.ДатаСнятия)) / 86400);
	ДнейВМесяце = День(КонецМесяца(ДанныеСчетчика.ДатаСнятия));
	//КоличествоДнейМес          = Число(Формат(Сред(КонецМесяца(ДанныеСчетчика.ДатаСнятия), 1, 2),"ЧЦ=2"));
	КвоКубовЗаДень                = ДанныеСчетчика.КвоКубов / ДнейВМесяце;
	Объект.ДосчитаноДоКонцаМесяца = Формат(КвоДнейДляДочисления * КвоКубовЗаДень - ДосчитановВПрошломМесяце, "ЧЦ=6");
	Объект.ЗначениеОбщедомовое    = ДанныеСчетчика.КвоКубов + Объект.ДосчитаноДоКонцаМесяца - ДосчитановВПрошломМесяце;
КонецПроцедуры

&НаКлиенте
Процедура ОбщедомовойПриборУчетаПриИзменении(Элемент)
	ОбщедомовойПриборУчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ОпределениеЗначениеНормы(Услуга, Здание, ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ТарифыСрезПоследних.Услуга,
	    |	ТарифыСрезПоследних.ЗначениеТарифа,
	    |	ТарифыСрезПоследних.НормаПотребления,
	    |	ТарифыСрезПоследних.ЗначениеТарифаПоНорме,
	    |	ВЫБОР
	    |		КОГДА ТарифыСрезПоследних.НормаПотребления <> 0
	    |			ТОГДА ""residentsNumber""
	    |		ИНАЧЕ Неопределено
	    |	КОНЕЦ КАК CHARACTERISTIC_TYPE
	    |ИЗ
	    |	РегистрСведений.Тарифы.СрезПоследних(
	    |			&НаДату,
	    |			Услуга = &Услуга
	    |				И Здание = &Здание) КАК ТарифыСрезПоследних";
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Здание", Здание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Норма = Выборка.НормаПотребления;
	КонецЦикла;
	Возврат Норма;
КонецФункции

&НаСервере
Функция ОпределитьответственныйВладелец(ЛицевойСчет)
    Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
	    |ИЗ
	    |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Владелец = Выборка.ОтветственныйВладелец;
	КонецЦикла;
	Возврат Владелец;
КонецФункции

&НаСервере
Функция ОпределитьСредннеНачисление(Здание)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПоказанияПриборовЗаМесяц.Разница,
	    |	ПоказанияПриборовЗаМесяц.ЛицевойСчет,
	    |	ПоказанияПриборовЗаМесяц.Период
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
	    |ГДЕ
	    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачПериода И &КонПериода
	    |	И ПоказанияПриборовЗаМесяц.НачислениеПоСреднему = ИСТИНА
	    |	И ПоказанияПриборовЗаМесяц.Здание = &Здание
	    |	И ПоказанияПриборовЗаМесяц.Услуга.ВидУслуги = &ВидУслуги";
	Запрос.УстановитьПараметр("НачПериода", Объект.НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.КонПериода));
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.ХолоднаяВода);
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из Результат Цикл
		Если стр.Разница = 0 Тогда
			Результат.Удалить(стр);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции
